# Join and Append Data Frames

Student-DB Extension: Extend your university database data frame from the previous exercise

Start with the following data frame from the last exercise

In [2]:
#PANDAS Data Frames
import pandas as pd

print("The original data frame:")
list_2dim = [[100112,"Jim Collins","Wifo",4],[120095,"Martin Schrader","Wifo",7],[180331,"Achim Zahn","OMM",1]]
df = pd.DataFrame(list_2dim,index=['ID1','ID2','ID3'],columns=['ID','Name','FoS','Semesters'])
df

The original data frame:

         ID             Name   FoS  Semesters
ID1  100112      Jim Collins  Wifo          4
ID2  120095  Martin Schrader  Wifo          7
ID3  180331       Achim Zahn   OMM          1

Create a new data frame storing ID and age of the three students

Set index of df to the attribute 'ID': df=df.set_index('ID')

Similarily set index of new data frame to the attribute 'ID

Join new data frame with the first one and show results!

In [3]:
new_list_2dim = [[df.iloc[0, 0], 21], 
                 [df.iloc[1, 0], 23], 
                 [df.iloc[2, 0], 19]]

new_df = pd.DataFrame(new_list_2dim, 
                      index=['ID1','ID2','ID3'], 
                      columns=['ID', 'Age'])
new_df

         ID  Age
ID1  100112   21
ID2  120095   23
ID3  180331   19

In [4]:
df = df.set_index('ID')
new_df = new_df.set_index('ID')

In [8]:
big_df = df.join(new_df, lsuffix='_df', rsuffix='_new_df')
big_df

                   Name   FoS  Semesters  Age
ID
100112      Jim Collins  Wifo          4   21
120095  Martin Schrader  Wifo          7   23
180331       Achim Zahn   OMM          1   19

Use the following dictionary to store an additional student

Transform the dictionary to a series and name your series object. The name is the "ID" of the student in this case

Append the series object tp your joined data frame

In [6]:
dict_obj = {'Name': 'Klaus Mayer', 'FoS': 'Wifo', 'Semesters': 2, 'Age': 20}

series = pd.Series(dict_obj, name=190287)

# In the newest Version the 'append' command have been changed to '_append'
big_df = big_df._append(series)
big_df

                   Name   FoS  Semesters  Age
ID
100112      Jim Collins  Wifo          4   21
120095  Martin Schrader  Wifo          7   23
180331       Achim Zahn   OMM          1   19
190287      Klaus Mayer  Wifo          2   20

Append data frame by dictionary

1. Transform dictionary to data frame "df_dict" using method from_dict
2. Add index to df_dict ("ID"-values of the students)
3. Append original data frame by df_dict

In [7]:
data = {'Name': ['John Doe', 'Henry Miller'], 'FoS': ['IW', 'OMM'],'Semesters': [3, 4], 'Age': [23, 24]}

#Transform dictionary to data frame "df_dict" using method from_dict
df_dict = pd.DataFrame.from_dict(data)

#Add index to df_dict ("ID"-values of the students)
df_dict.index=[123456, 987654]

#Append original data frame by df_dict
end_df = big_df._append(df_dict)
end_df

                   Name   FoS  Semesters  Age
100112      Jim Collins  Wifo          4   21
120095  Martin Schrader  Wifo          7   23
180331       Achim Zahn   OMM          1   19
190287      Klaus Mayer  Wifo          2   20
123456         John Doe    IW          3   23
987654     Henry Miller   OMM          4   24